Repository: akram02/codeforces_watcher
Catalog: ios/Codeforces Watcher/Resources/*.lproj/Localizable.strings
Languages: uk

# locale
source: en
uk: ru

source: Contests
uk: Контести

source: News
uk: Новини

source: Problems
uk: Задачі

source: Commented by
uk: Прокоментував

source: · %@ ago
uk: · %@ тому

# post_ago
source: · %@ %@ ago
uk: · %@ %@ тому

# news_explanation
source: Recent news are on the way to your device...
uk: Свіжі новини на шляху до вашого пристрою…

# problems_explanation
source: Problems are on the way to your device...
uk: Задачі на шляху до вашого пристрою…

# contests_explanation
source: Contests are on the way to your device...
uk: Контести на шляху до вашого пристрою…

source: Has been added to your calendar
uk: Був доданий до вашого календаря

source: Can't add contest to Calendar without permission
uk: Неможливо додати контест в календар без дозволу

source: OK
uk: Oк

source: Cancel
uk: Скасувати

# check_connection
source: Check your connection or try again later
uk: Перевірте з’єднання або спробуйте пізніше

source: Search for problems...
uk: Пошук задач…

source: Official Codeforces rules
uk: Офiцiйнi правила Codeforces

source: Apple isn't a sponsor of any contests conducted on Codeforces
uk: Apple не спонсор контестiв якi проводяться на Codeforces

source: Filters
uk: Фiльтри

source: User already added
uk: Користувача вже додано

# Click to see details
source: Click to see more
uk: Натисніть, щоб переглянути деталі…

source: Users
uk: Користувачi

source: Followed users
uk: Підписки

# no_favourite_problems_explanation
source: You don’t have any favourite problems yet. Add the first one using «∞» at the bottom of the screen.
uk: Ви ще не маєте улюблених задач. Додайте першу скориставшись кнопкою «∞» знизу екрану.

# share_cw_message
source: I'm using Codeforces WatchR - open-source, free IOS application, which leverages Codeforces API to bring more competitive programming to your IOS device. Codeforces WatchR allows: 1. Shortlist and register for upcoming Competitive Programming contests: Codeforces, LeetCode, HackerEarth, AtCoder, TopCoder, CS Academy, CodeChef, Kick Start. 2. Follow Recent News. 3. Browse and search for Problems, add them to favourites. 4. Watch for activity of any Codeforces user 5. Sort users by rating and last participation date. Download it now on App Store - https://apps.apple.com/us/app/codeforces-watchr-contests/id1495591299
uk: Я користуюсь Codeforces WatchR - безкоштовним IOS застосунком з відкритим кодом, що використовує Codeforces API для того щоб принести більше олімпіадного програмування на ваш IOS пристрій. Codeforces WatchR дає можливiсть: 1. Невеликий перерелік та реєстрація на змаганнях зі спортивного програмування: Codeforces, LeetCode, HackerEarth, AtCoder, TopCoder, CS Academy, CodeChef, Kick Start. 2. Слідкуйте за новими подіями на Codeforces. 3. Переглядайте і шукайте задачi, додавайте їх в улюбленi. 4. Слідкуйте за активністю будь-якого користувача Codeforces. 5. Сортуйте користувачів за рейтингом і датою останньої участі. Завантажуйте прямо зараз в App Store - https://apps.apple.com/us/app/codeforces-watchr-contests/id1495591299

# no_users_explanation
source: You don’t have any users to watch yet. Add the first one using «+» at the bottom of the screen.
uk: Ви ще не маєте користувачів для відслідковування. Додайте першого скориставшись кнопкою «+» знизу екрану.

source: Add user
uk: Додати користувача

source: Enter user handle
uk: Введiть хендл користувача

source: No activity
uk: Немає активності

source: Done
uk: Готово

source: Rating changes
uk: Змiни рейтингу

source: Delete user
uk: Видалити користувача

# delete_user_explanation
source: Are you sure you want to delete %@?
uk: Ви впевнені, що хочете видалити %@?

source: None
uk: Немає

# Rating
source: Rating: %@ (max: %@)
uk: Рейтинг: %@ (макс. %@)

source: Contribution: %@
uk: Внесок: %@

# Sort
source: Sort by %@ ▼
uk: Сорт. за %@ ▼

source: default
uk: замовчуванням

# rating_up
source: ↑rating
uk: ↑рейтингу

# rating_down
source: ↓rating
uk: ↓рейтингу

# update_up
source: ↑update
uk: ↑оновлення

# update_down
source: ↓update
uk: ↓оновлення

source: Last activity: %@
uk: Остання активність: %@

# share_text
source: %@ - %@ Shared through Codeforces Watcher. Find it on App Store.
uk: %@ - %@ Відправлено через Codeforces WatchR. Знайдiть його в App Store.

source: Upcoming contests
uk: Майбутні контести

source: Yes!
uk: Так!

# rate_us_first_title
source: Enjoying our Codeforces WatchR App?
uk: Вам подобається Codeforces WatchR?

# rate_us_second_title
source: Would you mind giving us some feedback?
uk: Ви б не хотіли дати нам відгук?

# rate_us_third_title
source: How about a rating on the App Store, then?
uk: То як щодо оцiнки в App Store?

source: Not really
uk: Не зовсім

source: No, thanks
uk: Нi, дякую

# chart_info
source: = %@ (%@) Rank: %@ %@ %@
uk: = %@ (%@) Мiсце: %@ %@ %@

# contest_date_format
source: HH:mm MMM d, EEEE
uk: d MMM о HH:mm, EEEE

# user_date_format
source: MMM d, yyyy
uk: d MMM yyyy

source: Be the first to comment
uk: Коментуйте першим

source: See all comments
uk: Переглянути всі коментарі

source: modified
uk: змiнено

source: created
uk: створено

source: Watch video
uk: Переглянути відео

source: Galactic master
uk: Галактичний майстер

source: Unknown
uk: Невідомо

source: Never updated
uk: Ніколи не оновлювався

source: Who are you?
uk: Хто ви?

# login_to_identify
source: Login to identify and get instant push notifications about rating updates
uk: Увійдіть для ідентифікації і отримуйте миттєві push-сповіщення про оновлення рейтингу

source: Login
uk: Увійти

source: Verify account
uk: Підтвердити акаунт

# verify_account_prompt
source: Pass the quick and simple verification to see your profile here
uk: Пройдіть швидку та просту перевірку, щоб побачити тут свій профіль

source: Verify
uk: Підтвердити

source: Email
uk: Електронна пошта

source: Password
uk: Пароль

source: Confirm password
uk: Підтвердьте пароль

source: Forgot password?
uk: Забули пароль?

source: Sign In
uk: Увійти

# sign_in_hint
source: Already have an account?
uk: Вже є обліковий запис?

source: Sign Up
uk: Зареєструватися

# sign_up_hint
source: Don't have an account yet?
uk: У вас ще немає облікового запису?

source: Agree to the privacy policy
uk: Погодьтеся з політикою конфіденційності

source: Restore password
uk: Відновлення пароля

# restore_password_button
source: Restore password
uk: Відновлення пароля

# restore_password_hint
source: You will get an email with instructions for account recovery
uk: Ви отримаєте електронний лист з інструкціями щодо відновлення облікового запису

# lost_access
source: Lost access to mail?
uk: Втрачено доступ до пошти?

# user_does_not_exist
source: User doesn't exist ¯_(ツ)_/¯
uk: Користувач не існує ¯_(ツ)_/¯

source: Check your box.
uk: Перевірте свою пошту.

# open_mail_hint
source: Tap to open your mail app
uk: Натисніть, щоб відкрити поштовий додаток

source: Open mail
uk: Відкрити пошту

source: Mail app not found
uk: Додаток пошти не знайдено

source: Back to sign in
uk: Повернутися до входу

# check_your_spam_folder
source: If you haven’t received a message within 5 minutes, check your Spam folder.
uk: Якщо ви не отримали повідомлення протягом 5 хвилин, перевірте папку Спам.

# agreement_terms_and_privacy
source: I agree with the <terms>Terms and Conditions</terms> and the <privacy>Privacy Policy</privacy>.
uk: Я погоджуюсь з <terms>Загальними положеннями та умовами</terms> та <privacy>Політикою конфіденційності</privacy>.

source: Verify Codeforces Account
uk: Підтвердити Codeforces акаунт

source: Codeforces handle
uk: Codeforces хэндл

# verify_instruction
source: To verify that account belongs to you, please, change your English ”Last name” in your <semibold>Profile -> Settings -> Social</semibold> to this value:
uk: Щоб підтвердити, що ваш акаунт належить вам, змініть англійськe "Прізвище" у своєму <semibold> Профілі -> Налаштування -> Соціальні </semibold> на таке значення:

# verify_change_it_back
source: After successful login you can change it back.
uk: Після успішного входу ви можете змінити його назад.

# rating_updated_on
source: Updated on %@
uk: Oновлено %@

source: Rating: %@
uk: Рейтинг: %@

source: Max rating: %@
uk: Макс. рейтинг: %@

source: Log out
uk: Вийти

# log_out_ask
source: Do you want to log out?
uk: Ви хочете вийти?

source: Wrong credentials!
uk: Неправильні дані!

source: Fields cannot be empty!
uk: Поля не можуть бути порожніми!

# passwords_do_not_match
source: Passwords don't match!
uk: Паролі не збігаються!

source: Ratings have been updated
uk: Рейтинги оновлені

# forgot_password_success
source: Email with further instructions has been sent to you! Please check!
uk: Вам надіслано електронний лист з подальшими інструкціями! Будь ласка, перевірте!
